In [6]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [7]:
s0w1d1 = pd.read_csv('../../data/processed/s0w1d1.csv')
s1w0d0 = pd.read_csv('../../data/processed/s1w0d0.csv')
s1w0d1 = pd.read_csv('../../data/processed/s1w0d1.csv')
s1w1d0 = pd.read_csv('../../data/processed/s1w1d0.csv')
s1w1d1 = pd.read_csv('../../data/processed/s1w1d1_1.csv')
oy_df = pd.read_csv('../../data/processed/oy.csv')

In [8]:
not_oy = [s0w1d1, s1w0d0, s1w0d1, s1w1d0, s1w1d1]

In [9]:
s1w0d0 = s1w0d0.append(pd.Series(), ignore_index=True)

In [10]:
s1w0d0.iloc[8]['count'] = 0

In [11]:
s1w0d0

    age  count
0  16.0  405.0
1  17.0  338.0
2  18.0  117.0
3  19.0   21.0
4  20.0   11.0
5  21.0    4.0
6  22.0    3.0
7  23.0    1.0
8   NaN    0.0

In [12]:
s1w0d1

   age  count
0   16      4
1   17     23
2   18     73
3   19     85
4   20     85
5   21     64
6   22     53
7   23     30
8   24     27

In [13]:
s1w1d0 = s1w1d0.append(pd.Series(), ignore_index=True)
s1w1d0 = s1w1d0.append(pd.Series(), ignore_index=True)
s1w1d0

    age  count
0  16.0   54.0
1  17.0   71.0
2  18.0   46.0
3  19.0    7.0
4  20.0    5.0
5  22.0    2.0
6  23.0    1.0
7   NaN    NaN
8   NaN    NaN

In [14]:
s1w1d0.iloc[7]['count'] = 0
s1w1d0.iloc[8]['count'] = 0
s1w1d0

    age  count
0  16.0   54.0
1  17.0   71.0
2  18.0   46.0
3  19.0    7.0
4  20.0    5.0
5  22.0    2.0
6  23.0    1.0
7   NaN    0.0
8   NaN    0.0

In [15]:
one_zero = pd.DataFrame({'age':[16], 'count':[0]})

s1w1d1_2 = one_zero.append(s1w1d1, ignore_index=True)
s1w1d1_2

   age  count
0   16      0
1   17     11
2   18     60
3   19     86
4   20     90
5   21     70
6   22     76
7   23     53
8   24     47

In [16]:
not_oy_ages = s0w1d1['count'] + s1w0d0['count'] + s1w0d1['count'] + s1w1d0['count'] + s1w1d1_2['count']

In [17]:
type(not_oy_ages)

pandas.core.series.Series

In [18]:
not_oy_ages.sum()

2970.0

In [19]:
not_oy = not_oy_ages
not_oy_index = list(range(16,25))

In [20]:
new_df = pd.DataFrame(data=not_oy_ages, columns=['count'])

In [21]:
new_df['age'] = s1w1d1_2['age']

In [22]:
new_df

   count  age
0  464.0   16
1  444.0   17
2  329.0   18
3  260.0   19
4  314.0   20
5  258.0   21
6  295.0   22
7  291.0   23
8  315.0   24

In [23]:
range_1 = new_df['count'][0:3].sum()
range_2 = new_df['count'][3:6].sum()
range_3 = new_df['count'][6:9].sum()
count_ranges  = np.array([range_1, range_2, range_3])
count_ranges

array([1237.,  832.,  901.])

In [24]:
age_range_1 = '16 - 18'
age_range_2 = '19 - 21'
age_range_3 = '22 - 24'
age_ranges = [age_range_1, age_range_2, age_range_3]
age_ranges

['16 - 18', '19 - 21', '22 - 24']

In [25]:
not_oy_df = pd.DataFrame(data=[count_ranges], columns=['16 - 18', '19 - 21', '22 - 24'])
not_oy_df

   16 - 18  19 - 21  22 - 24
0   1237.0    832.0    901.0

In [26]:
not_oy_df['Total'] = not_oy_df['16 - 18'] + not_oy_df['19 - 21'] + not_oy_df['22 - 24']

In [27]:
not_oy_df

   16 - 18  19 - 21  22 - 24   Total
0   1237.0    832.0    901.0  2970.0

In [28]:
concat = [new_oy_df, wwd_df, not_oy_df]
df_tp_2017 = pd.concat(concat)
df_tp_2017

NameError: name 'new_oy_df' is not defined